var num1 = Number(prompt("Бірінші сан енгізіңіз:"))
var num2 =  Number(prompt("Екінші сан енгізіңіз:"))
var num3 = Number(prompt("Үшінші сан енгізіңіз:"))

if((num1 > num2)&&(num2 > num3)){
    alert("Ең үлкен және ең кішкентай санның айырмасы: "+ (num1 - num3) + " бұл жерде екі саннын айырмасы болады"  )
}
else if((num1 < num2) && (num2 < num3 ) ){
    alert("Ең үлкен және ең кішкентай санның айырмасы: "+ (num3 - num1) + " бұл жерде екі саннын айырмасы болады")
}
else if((num1 < num2)&&(num2 > num3) && (num1 > num3)){
    alert("Ең үлкен және ең кішкентай санның айырмасы: "+ (num2 - num3) + " бұл жерде екі саннын айырмасы болады")
}
else if((num1 < num2)&&(num2 > num3) && (num3 > num1)){
    alert("Ең үлкен және ең кішкентай санның айырмасы: "+ (num2 - num1) + " бұл жерде екі саннын айырмасы болады") 
}